comparedDBs/performance_test_scripts/Rocksdb_scripts/10B_RocksDB_TwitterCluster1_Benchmarking/RocksDB_0.1B_in0.4B_val267_mem64MB_Cluster1_CT04_level1base512_targetbase64_Blk6_Blkcache128_Tabcache300.log
RocksDB:    version 9.4.0
Date:       Mon May 12 02:06:57 2025
CPU:        112 * Intel(R) Xeon(R) Gold 6348 CPU @ 2.60GHz
CPUCache:   43008 KB
workload_num: 100000000 entries_per_batch_:1
 The key size:80 value size:128 
The k_size:80 The v_size:267 
rocksdb.block-cache-usage COUNT : 30566352
rocksdb.block-cache-pinned-usage COUNT : 88
rocksdb.estimate-table-readers-mem COUNT : 551448
Total bytes written: 144
Set seed to 1746986816767043 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       80 bytes each (+ 0 bytes user-defined timestamp)
Values:     128 bytes each (0 bytes after compression)
Entries:    400000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    79345.7 MB (estimated)
FileSize:   30517.6 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 5
------------------------------------------------
DB path: [/mnt/db_test/rocks10B/Cluster1_0.4B_mem64MB_CT4_L1base512_targetbase64_Block6]
the row_data[5] is:get
the row_data[5] is:get
the row_data[5] is:get
[...]
clusterQuery :       2.235 micros/op 447394 ops/sec 223.160 seconds 99840311 operations;   62.2 MB/s PERF_CONTEXT:
user_key_comparison_count = 2304195278, block_cache_hit_count = 4001571, block_read_count = 4897, block_read_byte = 29635259, block_read_time = 891241196, block_read_cpu_time = 107526770, block_cache_index_hit_count = 0, block_cache_standalone_handle_count = 0, block_cache_real_handle_count = 0, index_block_read_count = 0, block_cache_filter_hit_count = 0, filter_block_read_count = 0, compression_dict_block_read_count = 0, block_cache_index_read_byte = 0, block_cache_filter_read_byte = 0, block_cache_compression_dict_read_byte = 0, block_cache_read_byte = 24648183840, secondary_cache_hit_count = 0, compressed_sec_cache_insert_real_count = 0, compressed_sec_cache_insert_dummy_count = 0, compressed_sec_cache_uncompressed_bytes = 0, compressed_sec_cache_compressed_bytes = 0, block_checksum_time = 3031072, block_decompress_time = 0, get_read_bytes = 26525215926, multiget_read_bytes = 0, iter_read_bytes = 0, blob_cache_hit_count = 0, blob_read_count = 0, blob_read_byte = 0, blob_read_time = 0, blob_checksum_time = 0, blob_decompress_time = 0, internal_key_skipped_count = 0, internal_delete_skipped_count = 0, internal_recent_skipped_count = 0, internal_merge_count = 0, internal_merge_point_lookup_count = 0, internal_range_del_reseek_count = 0, get_snapshot_time = 7940695184, get_from_memtable_time = 65669962790, get_from_memtable_count = 99416794, get_post_process_time = 9088277483, get_from_output_files_time = 8755326761, seek_on_memtable_time = 0, seek_on_memtable_count = 0, next_on_memtable_count = 0, prev_on_memtable_count = 0, seek_child_seek_time = 0, seek_child_seek_count = 0, seek_min_heap_time = 0, seek_max_heap_time = 0, seek_internal_seek_time = 0, find_next_user_entry_time = 0, write_wal_time = 1586999627, write_memtable_time = 716979802, write_delay_time = 0, write_scheduling_flushes_compactions_time = 30920431, write_pre_and_post_process_time = 151467381, write_thread_wait_nanos = 0, db_mutex_lock_nanos = 0, db_condition_wait_nanos = 0, merge_operator_time_nanos = 0, read_index_block_nanos = 0, read_filter_block_nanos = 0, new_table_block_iter_nanos = 2108073934, new_table_iterator_nanos = 0, block_seek_nanos = 2784022832, find_table_nanos = 0, bloom_memtable_hit_count = 0, bloom_memtable_miss_count = 0, bloom_sst_hit_count = 4006465, bloom_sst_miss_count = 15994, key_lock_wait_time = 0, key_lock_wait_count = 0, env_new_sequential_file_nanos = 0, env_new_random_access_file_nanos = 0, env_new_writable_file_nanos = 0, env_reuse_writable_file_nanos = 0, env_new_random_rw_file_nanos = 0, env_new_directory_nanos = 0, env_file_exists_nanos = 0, env_get_children_nanos = 0, env_get_children_file_attributes_nanos = 0, env_delete_file_nanos = 0, env_create_dir_nanos = 0, env_create_dir_if_missing_nanos = 0, env_delete_dir_nanos = 0, env_get_file_size_nanos = 0, env_get_file_modification_time_nanos = 0, env_rename_file_nanos = 0, env_link_file_nanos = 0, env_lock_file_nanos = 0, env_unlock_file_nanos = 0, env_new_logger_nanos = 0, get_cpu_nanos = 131614748229, iter_next_cpu_nanos = 0, iter_prev_cpu_nanos = 0, iter_seek_cpu_nanos = 0, iter_next_count = 0, iter_prev_count = 0, iter_seek_count = 0, encrypt_data_nanos = 0, decrypt_data_nanos = 0, number_async_seek = 0, bloom_filter_useful = 15994@level0, 0@level1, bloom_filter_full_positive = 2622866@level0, 1383599@level1, bloom_filter_full_true_positive = 2622696@level0, 1383599@level1, user_key_return_count = 2622696@level0, 1383599@level1, get_from_table_nanos = 4881441263@level0, 2817156899@level1, block_cache_hit_count = 2620261@level0, 1381310@level1, block_cache_miss_count = 2608@level0, 2289@level1
Microseconds per read:
Count: 99345378 Average: 2.2141  StdDev: 2.85
Min: 1  Median: 1.5882  Max: 14522
Percentiles: P50: 1.59 P75: 1.91 P99: 3.97 P99.9: 6.73 P99.99: 24.91
------------------------------------------------------
[       0,       1 ]  3714311   3.739%   3.739% #
(       1,       2 ] 78138752  78.654%  82.392% ################
(       2,       3 ] 12708774  12.793%  95.185% ###
(       3,       4 ]  3898150   3.924%  99.109% #
(       4,       6 ]   775694   0.781%  99.890% 
(       6,      10 ]    57027   0.057%  99.947% 
(      10,      15 ]    21265   0.021%  99.968% 
(      15,      22 ]    20235   0.020%  99.989% 
(      22,      34 ]     5088   0.005%  99.994% 
(      34,      51 ]      888   0.001%  99.995% 
(      51,      76 ]      275   0.000%  99.995% 
(      76,     110 ]     1407   0.001%  99.996% 
(     110,     170 ]      557   0.001%  99.997% 
(     170,     250 ]     2407   0.002%  99.999% 
(     250,     380 ]      481   0.000% 100.000% 
(     380,     580 ]       12   0.000% 100.000% 
(     580,     870 ]        7   0.000% 100.000% 
(     870,    1300 ]       10   0.000% 100.000% 
(    1300,    1900 ]       12   0.000% 100.000% 
(    1900,    2900 ]        7   0.000% 100.000% 
(    2900,    4400 ]       13   0.000% 100.000% 
(    4400,    6600 ]        5   0.000% 100.000% 
(   14000,   22000 ]        1   0.000% 100.000% 

Microseconds per write:
Count: 494933 Average: 6.4694  StdDev: 56.68
Min: 3  Median: 5.1900  Max: 8764
Percentiles: P50: 5.19 P75: 6.55 P99: 13.52 P99.9: 20.41 P99.99: 210.04
------------------------------------------------------
(       2,       3 ]       15   0.003%   0.003% 
(       3,       4 ]    91407  18.469%  18.472% ####
(       4,       6 ]   262267  52.990%  71.462% ###########
(       6,      10 ]   126797  25.619%  97.081% #####
(      10,      15 ]    13485   2.725%  99.806% #
(      15,      22 ]      604   0.122%  99.928% 
(      22,      34 ]      220   0.044%  99.972% 
(      34,      51 ]       36   0.007%  99.979% 
(      51,      76 ]       18   0.004%  99.983% 
(      76,     110 ]       10   0.002%  99.985% 
(     110,     170 ]       18   0.004%  99.989% 
(     170,     250 ]       13   0.003%  99.991% 
(     250,     380 ]        2   0.000%  99.992% 
(     870,    1300 ]        1   0.000%  99.992% 
(    1300,    1900 ]        1   0.000%  99.992% 
(    1900,    2900 ]        1   0.000%  99.992% 
(    2900,    4400 ]        4   0.001%  99.993% 
(    4400,    6600 ]       17   0.003%  99.997% 
(    6600,    9900 ]       17   0.003% 100.000% 



** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      2/0   13.65 MB   0.5      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0     85.0      0.23              0.14         3    0.078       0      0       0.0       0.0
  L1      1/0   13.56 MB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.5    147.2     50.2      0.27              0.15         1    0.270    141K    93K       0.0       0.0
 Sum      3/0   27.21 MB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   1.7     78.8     66.4      0.50              0.29         4    0.126    141K    93K       0.0       0.0
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   2.0     87.5     59.9      0.45              0.29         3    0.151    141K    93K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0    147.2     50.2      0.27              0.15         1    0.270    141K    93K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0     74.2      0.18              0.14         2    0.092       0      0       0.0       0.0
User      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0    124.4      0.05              0.00         1    0.050       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 223.5 total, 223.2 interval
Flush(GB): cumulative 0.019, interval 0.013
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 0.03 GB write, 0.15 MB/s write, 0.04 GB read, 0.18 MB/s read, 0.5 seconds
Interval compaction: 0.03 GB write, 0.12 MB/s write, 0.04 GB read, 0.18 MB/s read, 0.5 seconds
Estimated pending compaction bytes: 0
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 0, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 0, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 0, total-stops: 0
Block cache LRUCache@0x59f472875b00#897255 capacity: 128.00 MB seed: 279184451 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 0 last_secs: 4.7e-05 secs_since: 223
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **
** Level 0 read latency histogram (micros):
Count: 2630 Average: 218.4795  StdDev: 498.36
Min: 58  Median: 162.8000  Max: 5560
Percentiles: P50: 162.80 P75: 214.05 P99: 3270.00 P99.9: 5560.00 P99.99: 5560.00
------------------------------------------------------
(      51,      76 ]      346  13.156%  13.156% ###
(      76,     110 ]      771  29.316%  42.471% ######
(     110,     170 ]      225   8.555%  51.027% ##
(     170,     250 ]     1145  43.536%  94.563% #########
(     250,     380 ]       67   2.548%  97.110% #
(     380,     580 ]        5   0.190%  97.300% 
(     580,     870 ]        6   0.228%  97.529% 
(     870,    1300 ]       12   0.456%  97.985% 
(    1300,    1900 ]       13   0.494%  98.479% 
(    1900,    2900 ]       10   0.380%  98.859% 
(    2900,    4400 ]       15   0.570%  99.430% 
(    4400,    6600 ]       15   0.570% 100.000% 

** Level 1 read latency histogram (micros):
Count: 2298 Average: 191.3194  StdDev: 339.74
Min: 58  Median: 187.4121  Max: 7085
Percentiles: P50: 187.41 P75: 221.79 P99: 363.07 P99.9: 6124.07 P99.99: 7085.00
------------------------------------------------------
(      51,      76 ]      192   8.355%   8.355% ##
(      76,     110 ]      454  19.756%  28.111% ####
(     110,     170 ]      212   9.225%  37.337% ##
(     170,     250 ]     1337  58.181%  95.518% ############
(     250,     380 ]       92   4.003%  99.521% #
(     870,    1300 ]        1   0.044%  99.565% 
(    2900,    4400 ]        3   0.131%  99.695% 
(    4400,    6600 ]        6   0.261%  99.956% 
(    6600,    9900 ]        1   0.044% 100.000% 


** DB Stats **
Uptime(secs): 223.5 total, 223.2 interval
Cumulative writes: 494K writes, 494K keys, 494K commit groups, 1.0 writes per commit group, ingest: 0.17 GB, 0.77 MB/s
Cumulative WAL: 494K writes, 0 syncs, 494933.00 writes per sync, written: 0.17 GB, 0.77 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 494K writes, 494K keys, 494K commit groups, 1.0 writes per commit group, ingest: 171.34 MB, 0.77 MB/s
Interval WAL: 494K writes, 0 syncs, 494933.00 writes per sync, written: 0.17 GB, 0.77 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent
Write Stall (count): write-buffer-manager-limit-stops: 0

STATISTICS:
rocksdb.block.cache.miss COUNT : 11627
rocksdb.block.cache.hit COUNT : 4001603
rocksdb.block.cache.add COUNT : 4897
rocksdb.block.cache.add.failures COUNT : 0
rocksdb.block.cache.index.miss COUNT : 0
rocksdb.block.cache.index.hit COUNT : 0
rocksdb.block.cache.index.add COUNT : 0
rocksdb.block.cache.index.bytes.insert COUNT : 0
rocksdb.block.cache.filter.miss COUNT : 0
rocksdb.block.cache.filter.hit COUNT : 0
rocksdb.block.cache.filter.add COUNT : 0
rocksdb.block.cache.filter.bytes.insert COUNT : 0
rocksdb.block.cache.data.miss COUNT : 11627
rocksdb.block.cache.data.hit COUNT : 4001603
rocksdb.block.cache.data.add COUNT : 4897
rocksdb.block.cache.data.bytes.insert COUNT : 30129136
rocksdb.block.cache.bytes.read COUNT : 24648380624
rocksdb.block.cache.bytes.write COUNT : 30129136
rocksdb.block.cache.compression.dict.miss COUNT : 0
rocksdb.block.cache.compression.dict.hit COUNT : 0
rocksdb.block.cache.compression.dict.add COUNT : 0
rocksdb.block.cache.compression.dict.bytes.insert COUNT : 0
rocksdb.block.cache.add.redundant COUNT : 0
rocksdb.block.cache.index.add.redundant COUNT : 0
rocksdb.block.cache.filter.add.redundant COUNT : 0
rocksdb.block.cache.data.add.redundant COUNT : 0
rocksdb.block.cache.compression.dict.add.redundant COUNT : 0
rocksdb.secondary.cache.hits COUNT : 0
rocksdb.secondary.cache.filter.hits COUNT : 0
rocksdb.secondary.cache.index.hits COUNT : 0
rocksdb.secondary.cache.data.hits COUNT : 0
rocksdb.compressed.secondary.cache.dummy.hits COUNT : 0
rocksdb.compressed.secondary.cache.hits COUNT : 0
rocksdb.compressed.secondary.cache.promotions COUNT : 0
rocksdb.compressed.secondary.cache.promotion.skips COUNT : 0
rocksdb.bloom.filter.useful COUNT : 15994
rocksdb.bloom.filter.full.positive COUNT : 4006465
rocksdb.bloom.filter.full.true.positive COUNT : 4006295
rocksdb.bloom.filter.prefix.checked COUNT : 0
rocksdb.bloom.filter.prefix.useful COUNT : 0
rocksdb.bloom.filter.prefix.true.positive COUNT : 0
rocksdb.persistent.cache.hit COUNT : 0
rocksdb.persistent.cache.miss COUNT : 0
rocksdb.sim.block.cache.hit COUNT : 0
rocksdb.sim.block.cache.miss COUNT : 0
rocksdb.memtable.hit COUNT : 95339083
rocksdb.memtable.miss COUNT : 4006295
rocksdb.l0.hit COUNT : 2622696
rocksdb.l1.hit COUNT : 1383599
rocksdb.l2andup.hit COUNT : 0
rocksdb.compaction.key.drop.new COUNT : 93371
rocksdb.compaction.key.drop.obsolete COUNT : 0
rocksdb.compaction.key.drop.range_del COUNT : 0
rocksdb.compaction.key.drop.user COUNT : 0
rocksdb.compaction.range_del.drop.obsolete COUNT : 0
rocksdb.compaction.optimized.del.drop.obsolete COUNT : 0
rocksdb.compaction.cancelled COUNT : 0
rocksdb.number.keys.written COUNT : 494933
rocksdb.number.keys.read COUNT : 99345378
rocksdb.number.keys.updated COUNT : 0
rocksdb.bytes.written COUNT : 179660679
rocksdb.bytes.read COUNT : 26525215926
rocksdb.number.db.seek COUNT : 0
rocksdb.number.db.next COUNT : 0
rocksdb.number.db.prev COUNT : 0
rocksdb.number.db.seek.found COUNT : 0
rocksdb.number.db.next.found COUNT : 0
rocksdb.number.db.prev.found COUNT : 0
rocksdb.db.iter.bytes.read COUNT : 0
rocksdb.number.iter.skip COUNT : 0
rocksdb.number.reseeks.iteration COUNT : 0
rocksdb.num.iterator.created COUNT : 0
rocksdb.num.iterator.deleted COUNT : 0
rocksdb.no.file.opens COUNT : 8
rocksdb.no.file.errors COUNT : 0
rocksdb.stall.micros COUNT : 0
rocksdb.db.mutex.wait.micros COUNT : 0
rocksdb.number.multiget.get COUNT : 0
rocksdb.number.multiget.keys.read COUNT : 0
rocksdb.number.multiget.bytes.read COUNT : 0
rocksdb.number.multiget.keys.found COUNT : 0
rocksdb.number.merge.failures COUNT : 0
rocksdb.getupdatessince.calls COUNT : 0
rocksdb.wal.synced COUNT : 0
rocksdb.wal.bytes COUNT : 179660679
rocksdb.write.self COUNT : 494933
rocksdb.write.other COUNT : 0
rocksdb.write.wal COUNT : 494933
rocksdb.compact.read.bytes COUNT : 41962938
rocksdb.compact.write.bytes COUNT : 20797893
rocksdb.flush.write.bytes COUNT : 14313540
rocksdb.compact.read.marked.bytes COUNT : 0
rocksdb.compact.read.periodic.bytes COUNT : 0
rocksdb.compact.read.ttl.bytes COUNT : 0
rocksdb.compact.write.marked.bytes COUNT : 0
rocksdb.compact.write.periodic.bytes COUNT : 0
rocksdb.compact.write.ttl.bytes COUNT : 0
rocksdb.number.direct.load.table.properties COUNT : 0
rocksdb.number.superversion_acquires COUNT : 6
rocksdb.number.superversion_releases COUNT : 3
rocksdb.number.superversion_cleanups COUNT : 3
rocksdb.number.block.compressed COUNT : 0
rocksdb.number.block.decompressed COUNT : 0
rocksdb.bytes.compressed.from COUNT : 0
rocksdb.bytes.compressed.to COUNT : 0
rocksdb.bytes.compression_bypassed COUNT : 34927464
rocksdb.bytes.compression.rejected COUNT : 0
rocksdb.number.block_compression_bypassed COUNT : 5698
rocksdb.number.block_compression_rejected COUNT : 0
rocksdb.bytes.decompressed.from COUNT : 0
rocksdb.bytes.decompressed.to COUNT : 0
rocksdb.merge.operation.time.nanos COUNT : 0
rocksdb.filter.operation.time.nanos COUNT : 0
rocksdb.compaction.total.time.cpu_micros COUNT : 146798
rocksdb.row.cache.hit COUNT : 0
rocksdb.row.cache.miss COUNT : 0
rocksdb.read.amp.estimate.useful.bytes COUNT : 0
rocksdb.read.amp.total.read.bytes COUNT : 0
rocksdb.number.rate_limiter.drains COUNT : 0
rocksdb.blobdb.num.put COUNT : 0
rocksdb.blobdb.num.write COUNT : 0
rocksdb.blobdb.num.get COUNT : 0
rocksdb.blobdb.num.multiget COUNT : 0
rocksdb.blobdb.num.seek COUNT : 0
rocksdb.blobdb.num.next COUNT : 0
rocksdb.blobdb.num.prev COUNT : 0
rocksdb.blobdb.num.keys.written COUNT : 0
rocksdb.blobdb.num.keys.read COUNT : 0
rocksdb.blobdb.bytes.written COUNT : 0
rocksdb.blobdb.bytes.read COUNT : 0
rocksdb.blobdb.write.inlined COUNT : 0
rocksdb.blobdb.write.inlined.ttl COUNT : 0
rocksdb.blobdb.write.blob COUNT : 0
rocksdb.blobdb.write.blob.ttl COUNT : 0
rocksdb.blobdb.blob.file.bytes.written COUNT : 0
rocksdb.blobdb.blob.file.bytes.read COUNT : 0
rocksdb.blobdb.blob.file.synced COUNT : 0
rocksdb.blobdb.blob.index.expired.count COUNT : 0
rocksdb.blobdb.blob.index.expired.size COUNT : 0
rocksdb.blobdb.blob.index.evicted.count COUNT : 0
rocksdb.blobdb.blob.index.evicted.size COUNT : 0
rocksdb.blobdb.gc.num.files COUNT : 0
rocksdb.blobdb.gc.num.new.files COUNT : 0
rocksdb.blobdb.gc.failures COUNT : 0
rocksdb.blobdb.gc.num.keys.relocated COUNT : 0
rocksdb.blobdb.gc.bytes.relocated COUNT : 0
rocksdb.blobdb.fifo.num.files.evicted COUNT : 0
rocksdb.blobdb.fifo.num.keys.evicted COUNT : 0
rocksdb.blobdb.fifo.bytes.evicted COUNT : 0
rocksdb.blobdb.cache.miss COUNT : 0
rocksdb.blobdb.cache.hit COUNT : 0
rocksdb.blobdb.cache.add COUNT : 0
rocksdb.blobdb.cache.add.failures COUNT : 0
rocksdb.blobdb.cache.bytes.read COUNT : 0
rocksdb.blobdb.cache.bytes.write COUNT : 0
rocksdb.txn.overhead.mutex.prepare COUNT : 0
rocksdb.txn.overhead.mutex.old.commit.map COUNT : 0
rocksdb.txn.overhead.duplicate.key COUNT : 0
rocksdb.txn.overhead.mutex.snapshot COUNT : 0
rocksdb.txn.get.tryagain COUNT : 0
rocksdb.files.marked.trash COUNT : 0
rocksdb.files.marked.trash.deleted COUNT : 0
rocksdb.files.deleted.immediately COUNT : 8
rocksdb.error.handler.bg.error.count COUNT : 0
rocksdb.error.handler.bg.io.error.count COUNT : 0
rocksdb.error.handler.bg.retryable.io.error.count COUNT : 0
rocksdb.error.handler.autoresume.count COUNT : 0
rocksdb.error.handler.autoresume.retry.total.count COUNT : 0
rocksdb.error.handler.autoresume.success.count COUNT : 0
rocksdb.memtable.payload.bytes.at.flush COUNT : 127475530
rocksdb.memtable.garbage.bytes.at.flush COUNT : 110207265
rocksdb.verify_checksum.read.bytes COUNT : 0
rocksdb.backup.read.bytes COUNT : 0
rocksdb.backup.write.bytes COUNT : 0
rocksdb.remote.compact.read.bytes COUNT : 0
rocksdb.remote.compact.write.bytes COUNT : 0
rocksdb.hot.file.read.bytes COUNT : 0
rocksdb.warm.file.read.bytes COUNT : 0
rocksdb.cold.file.read.bytes COUNT : 0
rocksdb.hot.file.read.count COUNT : 0
rocksdb.warm.file.read.count COUNT : 0
rocksdb.cold.file.read.count COUNT : 0
rocksdb.last.level.read.bytes COUNT : 0
rocksdb.last.level.read.count COUNT : 0
rocksdb.non.last.level.read.bytes COUNT : 72677566
rocksdb.non.last.level.read.count COUNT : 4928
rocksdb.last.level.seek.filtered COUNT : 0
rocksdb.last.level.seek.filter.match COUNT : 0
rocksdb.last.level.seek.data COUNT : 0
rocksdb.last.level.seek.data.useful.no.filter COUNT : 0
rocksdb.last.level.seek.data.useful.filter.match COUNT : 0
rocksdb.non.last.level.seek.filtered COUNT : 0
rocksdb.non.last.level.seek.filter.match COUNT : 0
rocksdb.non.last.level.seek.data COUNT : 0
rocksdb.non.last.level.seek.data.useful.no.filter COUNT : 0
rocksdb.non.last.level.seek.data.useful.filter.match COUNT : 0
rocksdb.block.checksum.compute.count COUNT : 11651
rocksdb.block.checksum.mismatch.count COUNT : 0
rocksdb.multiget.coroutine.count COUNT : 0
rocksdb.read.async.micros COUNT : 0
rocksdb.async.read.error.count COUNT : 0
rocksdb.table.open.prefetch.tail.miss COUNT : 0
rocksdb.table.open.prefetch.tail.hit COUNT : 40
rocksdb.timestamp.filter.table.checked COUNT : 0
rocksdb.timestamp.filter.table.filtered COUNT : 0
rocksdb.readahead.trimmed COUNT : 0
rocksdb.fifo.max.size.compactions COUNT : 0
rocksdb.fifo.ttl.compactions COUNT : 0
rocksdb.prefetch.bytes COUNT : 0
rocksdb.prefetch.bytes.useful COUNT : 1349726
rocksdb.prefetch.hits COUNT : 40
rocksdb.footer.corruption.count COUNT : 0
rocksdb.db.get.micros P50 : 0.565951 P95 : 1.787482 P99 : 2.769475 P100 : 5604.000000 COUNT : 99345378 SUM : 106306086
rocksdb.db.write.micros P50 : 3.828690 P95 : 8.958307 P99 : 10.936908 P100 : 8763.000000 COUNT : 494933 SUM : 2639653
rocksdb.compaction.times.micros P50 : 270142.000000 P95 : 270142.000000 P99 : 270142.000000 P100 : 270142.000000 COUNT : 1 SUM : 270142
rocksdb.compaction.times.cpu_micros P50 : 146798.000000 P95 : 146798.000000 P99 : 146798.000000 P100 : 146798.000000 COUNT : 1 SUM : 146798
rocksdb.subcompaction.setup.times.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.table.sync.micros P50 : 1600.000000 P95 : 2010.000000 P99 : 2010.000000 P100 : 2010.000000 COUNT : 3 SUM : 4294
rocksdb.compaction.outfile.sync.micros P50 : 1315.000000 P95 : 1315.000000 P99 : 1315.000000 P100 : 1315.000000 COUNT : 1 SUM : 1315
rocksdb.wal.file.sync.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.manifest.file.sync.micros P50 : 352.000000 P95 : 500.000000 P99 : 500.000000 P100 : 500.000000 COUNT : 4 SUM : 1575
rocksdb.table.open.io.micros P50 : 2400.000000 P95 : 5363.000000 P99 : 5363.000000 P100 : 5363.000000 COUNT : 8 SUM : 22503
rocksdb.db.multiget.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.read.block.compaction.micros P50 : 1.208440 P95 : 2.676255 P99 : 3.142424 P100 : 7386.000000 COUNT : 6730 SUM : 120750
rocksdb.read.block.get.micros P50 : 182.272000 P95 : 293.494681 P99 : 767.050000 P100 : 5584.000000 COUNT : 4913 SUM : 928253
rocksdb.write.raw.block.micros P50 : 1.020985 P95 : 5.392857 P99 : 19.900000 P100 : 2588.000000 COUNT : 5710 SUM : 85140
rocksdb.numfiles.in.singlecompaction P50 : 5.000000 P95 : 5.000000 P99 : 5.000000 P100 : 5.000000 COUNT : 1 SUM : 5
rocksdb.db.seek.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.db.write.stall P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.sst.read.micros P50 : 178.509267 P95 : 249.987107 P99 : 1972.000000 P100 : 7085.000000 COUNT : 4928 SUM : 1014253
rocksdb.file.read.flush.micros P50 : 870.000000 P95 : 4132.000000 P99 : 4132.000000 P100 : 4132.000000 COUNT : 2 SUM : 4869
rocksdb.file.read.compaction.micros P50 : 5176.470588 P95 : 6574.117647 P99 : 7085.000000 P100 : 7085.000000 COUNT : 24 SUM : 108786
rocksdb.file.read.db.open.micros P50 : 2650.000000 P95 : 4808.000000 P99 : 4808.000000 P100 : 4808.000000 COUNT : 5 SUM : 14813
rocksdb.file.read.get.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.multiget.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.db.iterator.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.verify.db.checksum.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.file.read.verify.file.checksums.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.sst.write.micros P50 : 0.541319 P95 : 1.688330 P99 : 12.283673 P100 : 2582.000000 COUNT : 11424 SUM : 80374
rocksdb.file.write.flush.micros P50 : 0.542704 P95 : 4.288525 P99 : 14.202041 P100 : 2582.000000 COUNT : 4664 SUM : 33402
rocksdb.file.write.compaction.micros P50 : 0.542303 P95 : 1.510870 P99 : 3.270690 P100 : 2371.000000 COUNT : 4615 SUM : 32468
rocksdb.file.write.db.open.micros P50 : 0.536250 P95 : 1.629167 P99 : 3.322727 P100 : 2269.000000 COUNT : 2145 SUM : 14504
rocksdb.num.subcompactions.scheduled P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.bytes.per.read P50 : 267.000000 P95 : 267.000000 P99 : 267.000000 P100 : 267.000000 COUNT : 99345378 SUM : 26525215926
rocksdb.bytes.per.write P50 : 363.000000 P95 : 363.000000 P99 : 363.000000 P100 : 363.000000 COUNT : 494933 SUM : 179660679
rocksdb.bytes.per.multiget P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.compression.times.nanos P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.decompression.times.nanos P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.read.num.merge_operands P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.key.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.value.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.write.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.get.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.multiget.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.seek.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.next.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.prev.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.blob.file.write.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.blob.file.read.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.blob.file.sync.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.compression.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.blobdb.decompression.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.db.flush.micros P50 : 92500.000000 P95 : 96568.000000 P99 : 96568.000000 P100 : 96568.000000 COUNT : 2 SUM : 184030
rocksdb.sst.batch.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.multiget.io.batch.size P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.index.and.filter.blocks.read.per.level P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.sst.read.per.level P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.num.level.read.per.multiget P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.error.handler.autoresume.retry.count P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.async.read.bytes P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.poll.wait.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.prefetched.bytes.discarded P50 : 117500.000000 P95 : 272730.000000 P99 : 272730.000000 P100 : 272730.000000 COUNT : 13 SUM : 1852560
rocksdb.async.prefetch.abort.micros P50 : 0.000000 P95 : 0.000000 P99 : 0.000000 P100 : 0.000000 COUNT : 0 SUM : 0
rocksdb.table.open.prefetch.tail.read.bytes P50 : 150000.000000 P95 : 273408.000000 P99 : 273408.000000 P100 : 273408.000000 COUNT : 8 SUM : 1354752